package karp.基本功;

/**
 * @Author: pjx
 * @Date: 2019/1/4 9:14
 * @Version 1.0
 */
public class 射的用途及实现 {
//    Java反射机制主要提供了以下功能：在运行时构造一个类的对象；判断一个类所具有的成员变量和方法；
// 调用一个对象的方法；生成动态代理。反射最大的应用就是框架
//
//
//    Java反射的主要功能：
//
//    确定一个对象的类
//    取出类的modifiers,数据成员,方法,构造器,和超类.
//            找出某个接口里定义的常量和方法说明.
//            创建一个类实例,这个实例在运行时刻才有名字(运行时间才生成的对象).
//    取得和设定对象数据成员的值,如果数据成员名是运行时刻确定的也能做到.
//            在运行时刻调用动态对象的方法.
//            创建数组,数组大小和类型在运行时刻才确定,也能更改数组成员的值.
//            反射的应用很多，很多框架都有用到
//
//    spring 的 ioc/di 也是反射…
//    javaBean和jsp之间调用也是反射…
//    struts的 FormBean 和页面之间…也是通过反射调用…
//    JDBC 的 classForName()也是反射…
//    hibernate的 find(Class clazz) 也是反射…
//
//    反射还有一个不得不说的问题，就是性能问题，大量使用反射系统性能大打折扣。怎么使用使你的系统达到最优就看你系统架构和综合使用问题啦，这里就不多说了。
//            ---------------------
//    作者：cjbi
//    来源：CSDN
//    原文：https://blog.csdn.net/u010697681/article/details/79414112
//    版权声明：本文为博主原创文章，转载请附上博文链接！
}
